#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_subscription.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lZGE3MTAwYi1hZDRiLTRmYWUtODE4YS02YmFjODdhYTgwOTY7b2JqZWN0SWQ9MDY2MDBmZTMtMDdkYS00YTc3LWJkMGYtZmUwODUwMGM2NDBiO3N1YnNjcmlwdGlvbklkPTgwNmFhMzcxLWQ3MDgtNGZjNC05NWU5LWMyZDc4NzlmNjJkYjt0ZW5hbnRJZD0yM2NmMjQzOC0wYjI1LTRhNzEtYTU4ZS1mMjM1ODZhMjIwOGY=]
data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/virtualNetworks/vm-sample-lego-project-vnet]
azurerm_public_ip.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/publicIPAddresses/vm-sample-lego-project-pip]
azurerm_network_security_group.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkSecurityGroups/vm-sample-lego-project-nsg]
azurerm_subnet.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/virtualNetworks/vm-sample-lego-project-vnet/subnets/vm-sample-lego-project-subnet]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkInterfaces/vm-sample-lego-project-nic]
azurerm_network_interface_security_group_association.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkInterfaces/vm-sample-lego-project-nic|/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkSecurityGroups/vm-sample-lego-project-nsg]
azurerm_linux_virtual_machine.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Compute/virtualMachines/vm-sample-lego-project]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_automation_account.vm_snoozing will be created
  + resource "azurerm_automation_account" "vm_snoozing" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "swedencentral"
      + name                          = "aa-vm-snoozing-automation"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-vm-snoozing-automation"
      + sku_name                      = "Basic"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_automation_job_schedule.start_vms will be created
  + resource "azurerm_automation_job_schedule" "start_vms" {
      + automation_account_name = "aa-vm-snoozing-automation"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "action"   = "Start"
          + "tagname"  = "AutoSnooze"
          + "tagvalue" = "true"
        }
      + resource_group_name     = "rg-vm-snoozing-automation"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "rb-vm-snoozing-automation"
      + schedule_name           = "start-vms-schedule"
    }

  # azurerm_automation_job_schedule.stop_vms will be created
  + resource "azurerm_automation_job_schedule" "stop_vms" {
      + automation_account_name = "aa-vm-snoozing-automation"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "action"   = "Stop"
          + "tagname"  = "AutoSnooze"
          + "tagvalue" = "true"
        }
      + resource_group_name     = "rg-vm-snoozing-automation"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "rb-vm-snoozing-automation"
      + schedule_name           = "stop-vms-schedule"
    }

  # azurerm_automation_runbook.vm_snoozing will be created
  + resource "azurerm_automation_runbook" "vm_snoozing" {
      + automation_account_name = "aa-vm-snoozing-automation"
      + content                 = <<-EOT
            param(
                [Parameter(Mandatory=$true)]
                [ValidateSet("Start", "Stop")]
                [string]$Action,
            
                [Parameter(Mandatory=$false)]
                [string]$ResourceGroupName,
            
                [Parameter(Mandatory=$false)]
                [string]$VMNames,
            
                [Parameter(Mandatory=$false)]
                [string]$TagName = "AutoSnooze",
            
                [Parameter(Mandatory=$false)]
                [string]$TagValue = "true"
            )
            
            # Connect to Azure using Managed Identity
            try {
                Connect-AzAccount -Identity
                Write-Output "Successfully connected to Azure using Managed Identity"
            }
            catch {
                Write-Error "Failed to connect to Azure: $_"
                throw $_
            }
            
            # Get VMs based on filters
            $vms = @()
            
            if ($VMNames) {
                # Get specific VMs by name
                $vmNameList = $VMNames -split ","
                foreach ($vmName in $vmNameList) {
                    $vmName = $vmName.Trim()
                    if ($ResourceGroupName) {
                        $vm = Get-AzVM -ResourceGroupName $ResourceGroupName -Name $vmName -ErrorAction SilentlyContinue
                    }
                    else {
                        $vm = Get-AzVM | Where-Object { $_.Name -eq $vmName }
                    }
                    if ($vm) {
                        $vms += $vm
                    }
                }
            }
            elseif ($ResourceGroupName) {
                # Get all VMs in resource group with matching tags
                $vms = Get-AzVM -ResourceGroupName $ResourceGroupName | Where-Object { $_.Tags[$TagName] -eq $TagValue }
            }
            else {
                # Get all VMs with matching tags
                $vms = Get-AzVM | Where-Object { $_.Tags[$TagName] -eq $TagValue }
            }
            
            Write-Output "Found $($vms.Count) VM(s) to process"
            
            foreach ($vm in $vms) {
                $vmStatus = Get-AzVM -ResourceGroupName $vm.ResourceGroupName -Name $vm.Name -Status
                $powerState = ($vmStatus.Statuses | Where-Object { $_.Code -like "PowerState/*" }).Code
            
                Write-Output "VM: $($vm.Name) - Current State: $powerState"
            
                if ($Action -eq "Stop") {
                    if ($powerState -eq "PowerState/running") {
                        Write-Output "Stopping VM: $($vm.Name)"
                        Stop-AzVM -ResourceGroupName $vm.ResourceGroupName -Name $vm.Name -Force
                        Write-Output "Successfully stopped VM: $($vm.Name)"
                    }
                    else {
                        Write-Output "VM $($vm.Name) is not running, skipping stop action"
                    }
                }
                elseif ($Action -eq "Start") {
                    if ($powerState -ne "PowerState/running") {
                        Write-Output "Starting VM: $($vm.Name)"
                        Start-AzVM -ResourceGroupName $vm.ResourceGroupName -Name $vm.Name
                        Write-Output "Successfully started VM: $($vm.Name)"
                    }
                    else {
                        Write-Output "VM $($vm.Name) is already running, skipping start action"
                    }
                }
            }
            
            Write-Output "VM Snoozing automation completed successfully"
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "swedencentral"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "rb-vm-snoozing-automation"
      + resource_group_name     = "rg-vm-snoozing-automation"
      + runbook_type            = "PowerShell"
    }

  # azurerm_automation_schedule.start_vms will be created
  + resource "azurerm_automation_schedule" "start_vms" {
      + automation_account_name = "aa-vm-snoozing-automation"
      + expiry_time             = (known after apply)
      + frequency               = "Week"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "start-vms-schedule"
      + resource_group_name     = "rg-vm-snoozing-automation"
      + start_time              = (known after apply)
      + timezone                = "Europe/Amsterdam"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # azurerm_automation_schedule.stop_vms will be created
  + resource "azurerm_automation_schedule" "stop_vms" {
      + automation_account_name = "aa-vm-snoozing-automation"
      + expiry_time             = (known after apply)
      + frequency               = "Week"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "stop-vms-schedule"
      + resource_group_name     = "rg-vm-snoozing-automation"
      + start_time              = (known after apply)
      + timezone                = "Europe/Amsterdam"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # azurerm_linux_virtual_machine.main will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "main" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Compute/virtualMachines/vm-sample-lego-project"
        name                                                   = "vm-sample-lego-project"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "Environment" = "dev"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_network_interface.main will be updated in-place
  ~ resource "azurerm_network_interface" "main" {
        id                             = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkInterfaces/vm-sample-lego-project-nic"
        name                           = "vm-sample-lego-project-nic"
        tags                           = {
            "Environment" = "dev"
        }
        # (12 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "internal"
          ~ subnet_id                     = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/virtualNetworks/vm-sample-lego-project-vnet/subnets/vm-sample-lego-project-subnet" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_network_security_group.main will be updated in-place
  ~ resource "azurerm_network_security_group" "main" {
        id                  = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkSecurityGroups/vm-sample-lego-project-nsg"
        name                = "vm-sample-lego-project-nsg"
      ~ security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "Environment" = "dev"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.vm_snoozing will be created
  + resource "azurerm_resource_group" "vm_snoozing" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-vm-snoozing-automation"
    }

  # azurerm_role_assignment.vm_contributor will be created
  + resource "azurerm_role_assignment" "vm_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.main must be replaced
-/+ resource "azurerm_subnet" "main" {
      ~ default_outbound_access_enabled                = false -> true # forces replacement
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/virtualNetworks/vm-sample-lego-project-vnet/subnets/vm-sample-lego-project-subnet" -> (known after apply)
        name                                           = "vm-sample-lego-project-subnet"
      ~ private_endpoint_network_policies              = "Enabled" -> (known after apply)
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  + automation_account_id           = (known after apply)
  + automation_account_principal_id = (known after apply)
  + vm_snoozing_resource_group_name = "rg-vm-snoozing-automation"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Copilot, Action: `pull_request`, Workflow: `Terraform Azure Deployment`*